{
  "categories": [
    {
      "name": "Relationship Drama",
      "scenarios": [
        "Your friend says they want to break up with their partner but are scared to hurt their feelings. They ask for your advice. What do you tell them and why?",
        "Your sibling keeps borrowing your stuff without asking and it’s driving you crazy. They don’t see the problem. How do you explain why it bothers you?",
        "Your best friend is mad because you forgot their birthday. They won’t talk to you. What do you say to make things right and why?",
        "Your coworker keeps taking credit for your ideas in meetings. It’s frustrating, but you don’t want to seem petty. How do you address it with them and why?",
        "Your roommate never cleans up after themselves, and it’s causing tension. They think you’re overreacting. How do you explain your feelings and propose a solution?",
        "Your partner keeps canceling plans last minute, and it’s starting to feel disrespectful. How do you bring it up without starting a fight?",
        "Your friend is upset because you didn’t invite them to a group hangout. They feel left out. How do you explain your decision and mend things?",
        "Your parent keeps giving you unsolicited advice about your career, and it’s annoying. How do you set boundaries while keeping the peace?",
        "Your close friend is spreading rumors about another friend, and you’re caught in the middle. How do you address it without taking sides?",
        "Your neighbor keeps complaining about your loud music, but you think they’re being unreasonable. How do you find a compromise?",
        "Your cousin borrowed money from you and hasn’t paid it back, even though they promised. How do you ask for it without making things awkward?",
        "Your friend group is arguing over where to go on a trip, and it’s getting heated. How do you mediate and keep everyone happy?",
        "Your sibling is jealous of the attention you’re getting from family, and they’re acting cold. How do you address their feelings?",
        "Your classmate keeps texting you for homework answers, and it’s getting out of hand. How do you politely say no?",
        "Your friend is ignoring your messages after a small disagreement. How do you reach out to clear the air?"
      ]
    },
    {
      "name": "Hilarious Chaos",
      "scenarios": [
        "You’re at a friend’s house and accidentally break their favorite mug. They’re upset. How do you apologize and explain what happened?",
        "You’re in a quiet library and your phone starts playing a loud song. Everyone looks at you. What do you say to ease the awkwardness and why?",
        "You slip and fall in a puddle at a party, splashing water on everyone nearby. They’re annoyed. How do you laugh it off and explain yourself?",
        "You accidentally send a silly meme to your boss instead of a coworker. They reply, confused. How do you explain the mix-up and smooth things over?",
        "You’re giving a presentation and your slides are out of order, making it look ridiculous. The audience is giggling. How do you recover and explain the mistake?",
        "You accidentally walk into the wrong classroom and start unpacking your stuff before noticing. Everyone stares. How do you play it off?",
        "Your dog runs through a picnic, stealing food off the table, and people are annoyed. How do you apologize and lighten the mood?",
        "You mispronounce a word hilariously during a speech, and the audience laughs. How do you acknowledge it and keep going?",
        "You accidentally knock over a display in a store, and it makes a loud crash. Shoppers look at you. How do you handle it?",
        "You’re at a restaurant and accidentally order something you’re allergic to, causing a scene when you send it back. How do you explain?",
        "You get stuck in a revolving door at a busy event, and people are watching. How do you laugh it off and explain what happened?",
        "You accidentally wear your shirt inside out all day, and someone finally points it out. How do you respond to ease the embarrassment?",
        "You trip on stage during a school play, causing a prop to fall. The audience chuckles. How do you recover and keep the show going?",
        "You accidentally call someone by the wrong name in a group chat, and they’re offended. How do you apologize and make it funny?",
        "You’re singing karaoke and forget the lyrics, freezing on stage. How do you joke about it and move on?"
      ]
    },
    {
      "name": "Life-or-Death Dilemmas",
      "scenarios": [
        "You’re in a game show with your friends, and only one can win a big prize. You have to pick who deserves it. Who do you choose and why?",
        "You find a wallet with a lot of money but no ID. Your friends say to keep it, but you’re not sure. What do you do and why?",
        "You’re stuck in a room with your friends and only one can leave to get help. Who do you pick to go and why?",
        "You’re on a sinking boat with your family, and there’s only one life jacket left. Who do you give it to and why?",
        "You discover a secret that could ruin a friend’s reputation, but telling the truth might hurt someone else. What do you do and why?",
        "You’re in a survival scenario with limited food, and you must decide who gets the last portion. Who do you choose and why?",
        "You can save only one item from a burning building: a family heirloom, a pet, or a stranger’s valuable. What do you pick and why?",
        "You’re in a group project, and one person isn’t pulling their weight. If you tell the teacher, they’ll fail, but if you don’t, your grade suffers. What do you do?",
        "You overhear a plan to cheat on a major exam, and your best friend is involved. Reporting it could get them expelled. What do you do and why?",
        "You’re offered a dream job, but it means moving far away from your family. Your parents beg you to stay. What do you choose and why?",
        "You find evidence that a coworker is stealing from the company, but they’re your friend. Reporting them could ruin their life. What do you do?",
        "You’re in a post-apocalyptic scenario and can only take one person with you to safety. Who do you choose and why?",
        "You have one ticket to a life-changing event, but two friends really want to go. Who do you give it to and why?",
        "You’re entrusted with a secret that could save someone’s life but would betray a friend’s trust. What do you do and why?",
        "You’re leading a team, and you must fire one person to save the project. Who do you let go and why?"
      ]
    },
    {
      "name": "Embarrassing Moments",
      "scenarios": [
        "You call your teacher ‘Mom’ in front of the whole class by mistake. Everyone laughs. What do you say to move past it and why?",
        "You wear mismatched shoes to a friend’s party and someone points it out. How do you explain it and make it less awkward?",
        "You accidentally burp loudly during a quiet moment at dinner with friends. They stare at you. What do you say to smooth things over and why?",
        "You trip and spill your drink on the table during a fancy dinner. Everyone notices. How do you laugh it off and explain what happened?",
        "You accidentally reply-all to an email with a personal comment meant for one person. People are whispering about it. How do you address the mistake and why?",
        "You wave at someone you think you know, but it’s a stranger who looks confused. People nearby notice. How do you play it off?",
        "You accidentally post an embarrassing photo on social media and don’t notice for hours. Friends are commenting. How do you handle it?",
        "You get food stuck in your teeth during a date, and they point it out. How do you laugh it off and keep the conversation going?",
        "You mishear a question in a job interview and give a completely irrelevant answer. The interviewer looks puzzled. How do you recover?",
        "You accidentally send a text complaining about someone to that person. They’re upset. How do you apologize and explain?",
        "You forget someone’s name while introducing them at a party, and they look embarrassed. How do you smooth it over?",
        "You laugh at a joke during a serious meeting, and everyone stares. How do you explain yourself and move on?",
        "You accidentally use the wrong restroom and walk out to curious glances. How do you laugh it off and explain?",
        "You drop your phone in public, and it starts playing an embarrassing voicemail out loud. How do you handle the situation?",
        "You’re caught singing loudly in your car at a stoplight, and the driver next to you is laughing. How do you respond to ease the moment?"
      ]
    }
  ]
}
