{
  "categories": [
    {
      "name": "Relationship Drama",
      "scenarios": [
        "Your friend says they want to break up with their partner but are scared to hurt their feelings. They ask for your advice. What do you tell them and why?",
        "Your sibling keeps borrowing your stuff without asking and it’s driving you crazy. They don’t see the problem. How do you explain why it bothers you?",
        "Your best friend is mad because you forgot their birthday. They won’t talk to you. What do you say to make things right and why?"
      ]
    },
    {
      "name": "Hilarious Chaos",
      "scenarios": [
        "You’re at a friend’s house and accidentally break their favorite mug. They’re upset. How do you apologize and explain what happened?",
        "You’re in a quiet library and your phone starts playing a loud song. Everyone looks at you. What do you say to ease the awkwardness and why?",
        "You slip and fall in a puddle at a party, splashing water on everyone nearby. They’re annoyed. How do you laugh it off and explain yourself?"
      ]
    },
    {
      "name": "Life-or-Death Dilemmas",
      "scenarios": [
        "You’re in a game show with your friends, and only one can win a big prize. You have to pick who deserves it. Who do you choose and why?",
        "You find a wallet with a lot of money but no ID. Your friends say to keep it, but you’re not sure. What do you do and why?",
        "You’re stuck in a room with your friends and only one can leave to get help. Who do you pick to go and why?"
      ]
    },
    {
      "name": "Embarrassing Moments",
      "scenarios": [
        "You call your teacher ‘Mom’ in front of the whole class by mistake. Everyone laughs. What do you say to move past it and why?",
        "You wear mismatched shoes to a friend’s party and someone points it out. How do you explain it and make it less awkward?",
        "You accidentally burp loudly during a quiet moment at dinner with friends. They stare at you. What do you say to smooth things over and why?"
      ]
    }
  ]
}
